In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame([[1,np.nan,2],[2,3,5],[np.nan,4,6]])

In [3]:
print(df)

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [4]:
# check if the dataframe has any missing values
df.isnull()

       0      1      2
0  False   True  False
1  False  False  False
2   True  False  False

In [5]:
# drop NA values
# all rows with cells containing NA will be dropped 
df.dropna()

     0    1  2
1  2.0  3.0  5

In [6]:
# drop columns where cells have NAs
df.dropna(axis=1)

   2
0  2
1  5
2  6

In [7]:
df.dropna(axis= 1, how="all")

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [8]:
df.dropna(thresh=2)

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [9]:
# Fill NA values 
# fill NAs with zero
df.fillna(0)

     0    1  2
0  1.0  0.0  2
1  2.0  3.0  5
2  0.0  4.0  6

In [10]:
# specify forward fill 
df.fillna(method="ffill")

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  2.0  4.0  6

In [11]:
# fill forwrad caolumn wise
df.fillna(method="ffill", axis=1)

     0    1    2
0  1.0  1.0  2.0
1  2.0  3.0  5.0
2  NaN  4.0  6.0

In [12]:
# back fill to propagate the next values backward
df.fillna(method="bfill")

     0    1  2
0  1.0  3.0  2
1  2.0  3.0  5
2  NaN  4.0  6